## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_acm_certificate.form_viewer (deposed object 7bf10a94) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_acm_certificate" "form_viewer" {
      - arn                       = "arn:aws:acm:ca-central-1:687401027353:certificate/387f24ee-0a1d-48be-979a-e4196ea1a401" -> null
      - domain_name               = "forms-staging.cdssandbox.xyz" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "forms-staging.cdssandbox.xyz"
              - resource_record_name  = "_42cd5dd49f1c1123566280c716149b50.forms-staging.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_daaca6a8062fb25ab6d88dcde571d1a3.rlltrpyzyf.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:ca-central-1:687401027353:certificate/387f24ee-0a1d-48be-979a-e4196ea1a401" -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [] -> null
      - tags                      = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                  = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_route53_health_check.gc_forms_application must be replaced
-/+ resource "aws_route53_health_check" "gc_forms_application" {
      ~ arn                    = "arn:aws:route53:::healthcheck/0005571a-3937-4194-ad31-dc5f16a05e93" -> (known after apply)
      - child_health_threshold = 0 -> null
      - child_healthchecks     = [] -> null
      ~ enable_sni             = true -> (known after apply)
      ~ id                     = "0005571a-3937-4194-ad31-dc5f16a05e93" -> (known after apply)
      - invert_healthcheck     = false -> null
      ~ port                   = 443 -> 80
      - regions                = [] -> null
        tags                   = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ type                   = "HTTPS" -> "HTTP" # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_route53_record.form_viewer[0] will be updated in-place
  ~ resource "aws_route53_record" "form_viewer" {
      ~ health_check_id = "0005571a-3937-4194-ad31-dc5f16a05e93" -> (known after apply)
        id              = "Z05990652HOQ0SGHD81ZC_forms-staging.cdssandbox.xyz_A_form_viewer_forms-staging.cdssandbox.xyz_primary"
        name            = "forms-staging.cdssandbox.xyz"
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_website_configuration.maintenance_mode will be created
  + resource "aws_s3_bucket_website_configuration" "maintenance_mode" {
      + bucket           = "gc-forms-application-maintenance-page"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # aws_wafv2_regex_pattern_set.forms_base_url will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "forms_base_url" {
        id          = "92da9411-8b49-4c9e-b80f-ac7ea482f3d1"
        name        = "forms_base_url"
        tags        = {}
        # (5 unchanged attributes hidden)

      - regular_expression {
          - regex_string = "^form-viewer-1810755345.ca-central-1.elb.amazonaws.com$" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_wafv2_web_acl.forms_maintenance_mode_acl will be created
  + resource "aws_wafv2_web_acl" "forms_maintenance_mode_acl" {
      + arn        = (known after apply)
      + capacity   = (known after apply)
      + id         = (known after apply)
      + lock_token = (known after apply)
      + name       = "GCFormsMaintenanceMode"
      + scope      = "CLOUDFRONT"
      + tags       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all   = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }

      + default_action {
          + block {
            }
        }

      + rule {
          + name     = "AllowGetRequestOnRootOnly"
          + priority = 0

          + action {
              + allow {
                }
            }

          + statement {
              + and_statement {
                  + statement {
                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "GET"

                          + field_to_match {
                              + method {}
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                  + statement {
                      + byte_match_statement {
                          + positional_constraint = "EXACTLY"
                          + search_string         = "/"

                          + field_to_match {
                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 0
                              + type     = "NONE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AllowGetRequestOnRootOnly"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = false
          + metric_name                = "forms_maintenance_mode_global_rule"
          + sampled_requests_enabled   = false
        }
    }

Plan: 3 to add, 2 to change, 2 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 5 more similar warnings elsewhere)

Error: asynchronous ACM service domain validation assignment not complete, need to retry: {
  DomainName: "forms-staging.cdssandbox.xyz",
  ValidationDomain: "forms-staging.cdssandbox.xyz",
  ValidationMethod: "DNS",
  ValidationStatus: "PENDING_VALIDATION"
}

  with aws_acm_certificate.form_viewer,
  on certificates.tf line 5, in resource "aws_acm_certificate" "form_viewer":
   5: resource "aws_acm_certificate" "form_viewer" {


Error: asynchronous ACM service domain validation assignment not complete, need to retry: {
  DomainName: "forms-staging.cdssandbox.xyz",
  ValidationDomain: "forms-staging.cdssandbox.xyz",
  ValidationMethod: "DNS",
  ValidationStatus: "PENDING_VALIDATION"
}

  with aws_acm_certificate.form_viewer_maintenance_mode,
  on certificates.tf line 21, in resource "aws_acm_certificate" "form_viewer_maintenance_mode":
  21: resource "aws_acm_certificate" "form_viewer_maintenance_mode" {

time=2023-11-16T15:59:41Z level=error msg=Terraform invocation failed in /home/runner/work/forms-terraform/forms-terraform/env/cloud/load_balancer/.terragrunt-cache/8CJu3E6tls1VOlHT6vQAFFRgrcQ/-syjFrdAaB-6kNXhMmF1nXBOp7o/load_balancer prefix=[/home/runner/work/forms-terraform/forms-terraform/env/cloud/load_balancer] 
time=2023-11-16T15:59:41Z level=error msg=1 error occurred:
	* [/home/runner/work/forms-terraform/forms-terraform/env/cloud/load_balancer/.terragrunt-cache/8CJu3E6tls1VOlHT6vQAFFRgrcQ/-syjFrdAaB-6kNXhMmF1nXBOp7o/load_balancer] exit status 1



```

</details>

